tap "1password/tap"
tap "drud/ddev"
tap "eugenmayer/dockersync"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mutagen-io/mutagen"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell plugin manager
brew "antibody"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Backup tool
brew "bup"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Top-like interface for container metrics
brew "ctop"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Modern replacement for 'ls'
brew "exa"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind", args: ["HEAD"]
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Rainbows and unicorns in your console!
brew "lolcat"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# General-purpose scripting language
brew "php@7.4", restart_service: true
# General-purpose scripting language
brew "php@8.0", restart_service: true, link: true
# Draw UML diagrams
brew "plantuml"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Sparklines for the shell
brew "spark"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Tool Command Language
brew "tcl-tk"
# Code-search similar to ack
brew "the_silver_searcher"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool for OSX
brew "unison"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# DDEV
brew "drud/ddev/ddev"
# A layer for unison-fsmonitor arround either macfsevents or watchdog for usage with unison
brew "eugenmayer/dockersync/unox"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Offline toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-inconsolata"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Visual diff and merge tool
cask "meld"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
