tap "bramstein/webfonttools"
tap "dart-lang/dart"
tap "eugenmayer/dockersync"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mutagen-io/mutagen"
tap "romkatv/powerlevel10k"
tap "sass/sass"
brew "ack"
brew "aircrack-ng"
brew "antibody"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bench"
brew "binutils"
brew "xz"
brew "python@3.9"
brew "glib"
brew "gmp"
brew "gobject-introspection"
brew "harfbuzz"
brew "libraqm"
brew "numpy"
brew "p7zip"
brew "pillow"
brew "binwalk"
brew "cifer"
brew "libtool"
brew "freetds"
brew "php", link: false
brew "composer"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "fd"
brew "findutils"
brew "fish"
brew "foremost"
brew "fortune"
brew "fzf"
brew "gdk-pixbuf"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "python@3.10"
brew "glances"
brew "guile"
brew "gnutls"
brew "gnupg"
brew "netpbm"
brew "python@3.8"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "hashpump"
brew "lua"
brew "highlight"
brew "htop"
brew "libfido2"
brew "libssh"
brew "hydra"
brew "libheif"
brew "imagemagick"
brew "john"
brew "knock"
brew "ldns"
brew "libdnet"
brew "libproxy"
brew "lynx"
brew "moreutils"
brew "neofetch"
brew "nghttp2"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openssh"
brew "peco"
brew "php-cs-fixer"
brew "pigz"
brew "pngcheck"
brew "pv"
brew "qt"
brew "rename"
brew "rlwrap"
brew "ruby"
brew "screen"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "sqlmap"
brew "ssh-copy-id", link: true
brew "task"
brew "taskd"
brew "tasksh"
brew "taskwarrior-tui"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "the_silver_searcher"
brew "tig"
brew "timewarrior"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "ucspi-tcp"
brew "unison"
brew "vbindiff"
brew "wget"
brew "woff2"
brew "xpdf"
brew "youtube-dl"
brew "zopfli"
brew "zsh"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "go-task/tap/go-task", link: false
brew "mutagen-io/mutagen/mutagen", link: false
brew "romkatv/powerlevel10k/powerlevel10k", link: false
brew "sass/sass/sass", link: false
cask "breaktimer"
cask "devutils"
cask "docker"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "insomnia"
cask "iterm2"
cask "java"
cask "macvim"
cask "mark-text"
cask "meld"
cask "numi"
cask "onyx"
cask "sublime-text"
cask "taskwarrior-pomodoro"
cask "visual-studio-code"
